In [1]:
import pandas as pd
import numpy as np

In [2]:
df_customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "name": ["Adam", "Bob", "Charlie", "Dave"]
})

In [3]:
df_orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "customer_id": [2, 1, 4, 5],
    "amount": [250, 120, 300, 180]
})

In [7]:
pd.merge(df_customers, df_orders, on="customer_id")                  # Inner Join
# the common customer id will only get merged
# inner join

   customer_id  name  order_id  amount
0            1  Adam       102     120
1            2   Bob       101     250
2            4  Dave       103     300

In [8]:
pd.merge(df_customers, df_orders, on="customer_id", how="left")      # Left Join
# keep all values in left table(customers) but for right table swap unknown with NaN(data which exists in left but not right)

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0

In [9]:
pd.merge(df_customers, df_orders, on="customer_id", how="right")     # Right Join

   customer_id  name  order_id  amount
0            2   Bob       101     250
1            1  Adam       102     120
2            4  Dave       103     300
3            5   NaN       104     180

In [10]:
pd.merge(df_customers, df_orders, on="customer_id", how="outer")     # Outer Join

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0
4            5      NaN     104.0   180.0